cases/CounterFlow/Coarse/laminarPimpleSMOKE-flamelet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   	uniform (0 0 0);

boundaryField
{
    fuelinlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    oxidizerinlet
    {
        type            fixedValue;
        value           uniform (0 0 -1);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    bottom
    {
        type            wedge;
    }
    top
    {
        type            wedge;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}



// ************************************************************************* //
